# GetAnElement Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCProductWrapper..::..GetAnElement Method
IFCProductWrapper Class See Also
---
Gets the first element handle added to this wrapper.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCAnyHandle GetAnElement()
```

Visual Basic
---
```text
Public Function GetAnElement As IFCAnyHandle
```

Visual C++
---
```text
public:
IFCAnyHandle^ GetAnElement()
```

# ### Return Value
The handle.
# See Also
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace